{
    "1": [
        "https://jjdaviesblogs.github.io/images/welcome.png",
        "536",
        "354",
        "Welcome - From The Developer!",
        "A warm welcome to you, dear reader, to <b>JJDBlogs</b>! Home to a variety of blogs, written by the developer of this website, Jessica Davies.<br><br>I hope you find this website easy to use and comfortable on your eyes. And I hope there's something for everyone here at JJDBlogs.<br><br>Enjoy!",
        "Welcome Message"
    ],

    "2": [
        "https://jjdaviesblogs.github.io/images/react_app_vscode.png",
        "755",
        "453",
        "Creating Your First React Project in VS Code",
        "<h3>Introduction</h3><br>The intro is going here.<br><br><h3>Steps</h3><br>This tutorial is from a Windows 11 user.<br><ol><br>    <li>Open the terminal/command prompt or whatever OS you're on.</li><br>    <li>Type `cd`, followed by the path to the chosen directory.</li><br>    <li>Type `npm create vite@latest`</li><br>    <li>If any packages need installing, you'll see the name of those packages, followed by `Ok to proceed? (y)`. Simply type `y`, press enter, and it will install the packages mentioned.<br>    <li>Enter your project's name. The default name here is `vite-project`, as shown on the terminal.</li><br>    <li>Now, using your arrow keys, from the list of frameworks, select 'React', then press <ENTER> to confirm.</li><br>    <li>From the variants list, using your arrow keys again, select 'TypeScript', then press <ENTER> to confirm.</li><br>    <li>You should see three commands that need to be run, in that order:</li><br><br>    a) <code style='color: green; background-color:'>cd [name of your project]</code><br><br>    b) <code style='color: green; background-color:'>npm install</code><br><br>    c) <code style='color: green; background-color:'>npm run dev</code><br>    <br>    <li>Open VS Code, then on the nav bar, go to File -> Open Folder, and search for your project. Once found, select it, and the generated skeleton code should be generated.</li><br>    <li>Open the terminal, either using Ctrl+i, or on the nav bar, select Terminal -> New Terminal.</li><br>    <li>Enter the three commands, one at a time, into the terminal. When the third command (npm run dev) is entered, you'll be given a Localhost link, and, when selected, will run your project.</li><br>    <li>To kill the localhost, click on the terminal and press Ctrl+C.</li><br></ol>", 
        "Programming"
    ]
}
