{
    "1": [
        "https://jjdblogs.org.uk/images/guide_html_css.png",
        "632",
        "352",
        "The Ultimate Beginner's Guide to HTML and CSS",
        "Web development is highly used in literally every single business you have come across, and it's used to provide people with a way to design, develop, and publish a website that does... well, anything you want it to. If you're a beginner wanting to get into web development, you've come to the right article!<br><br>In this guide, I will walk you through the basics of HTML and CSS, starting with HTML for structure and layout, then CSS for style and design.<br><br><h3>Why Learn HTML and CSS?</h3><br>Now, as a beginner programmer, you may be thinking to yourself: '<em>There's plenty of website builders across the web, why would I spend time learning these languages, when I can just drag and drop elements onto my webpage and call it a day?</em>', and to that I say that most of these website building apps are pricey, but I agree that it can be much simpler since all you're doing is drag and drop. However, in my own experience, when I write my own website code from scratch, it feels more personal. Using basic HTML tags with some CSS styling, you can create some amazing designs, and don't need to spend any money.<br><br>Be sure to check <a href='https://github.com/jjdaviesblogs/html_css_source'>here</a> if you want to view or download the source code for this tutorial on GitHub!<br><br><h3>Requirement Recommendations</h3><br>For this tutorial, I'd highly recommend two things:<br><br><ol><br>    <li>Download Visual Studio Code (VS Code), which is completely free, and is a very popular IDE for literally writing code in <b>any programming language</b>. However, you can still use just a regular notepad, as long as you save your code as <code style='color: green;'>.html</code> and <code style='color: green;'>.css</code> respectively.</li><br>    <li>Type out each piece of code from each image. When copying and pasting code, or just downloading the source code for this tutorial, then chances are, the next day, you'll completely forget about what you learnt</li><br></ol><br><br>Now that that's out the way, let's begin!<br><br><h3>Skeleton Code for HTML</h3><br>On VS Code, after creating a new <code style='color: green;'>.HTML</code> file, if you type <code style='color: green;'>Shift+!+Enter</code>, it will generate some skeleton that looks like this:<br><br><img src='https://jjdblogs.org.uk/imgs_in_article/html_guide_1.png'><br><br>Let's go through each line in the above image.<br><br><code style='color: green;'><br>    /<!DOCTYPE html/><br>    /<html lang='en'/><br></code><br><br>These two lines declare the type of document it is, as well as sets the language to English.<br><br><code style='color: green;'><br>    /<head/><br></code><br><br>This is used for defining the title in the browser's title bar or tab, as well as any metadata. You can think of metadata as 'data that describes other data'. In this case, the metadata is describing our webpage.<br><br>(TO BE CONTINUED)", "Web Development", 
        "12/09/2024 15:17"
    ]
}
