{
    "1": [
        "https://jjdblogs.org.uk/images/writing_prompts.png",
        "763",
        "510",
        "20+ Intriguing Writing Prompts to Inspire You to Start Writing Today",
        "It's difficult to find inspiration as a creative writer, especially if you wish to get into creative writing, or the creative industry in general. If you're feeling a little low on inspiration, you've come to the right article! I've compiled a list of completely random writing prompts, of all genres, for you to be inspired and to start writing short & fictitious stories today.<br><br>One piece of advice I like to give to writers is to always remember to <b>write what you would like to read!</b> Whether that's murder mysteries, or science-fiction, it's your canvas, you write whatever you want.<br><br>Without further ado, let's look at the list!<br><ol><br><li>'He was invited to have an exclusive interview with the CEO'</li><br><li>'Stop calling me, Matthew. I've had enough'</li><br><li>'Her husband accidentally sent her a text that was meant for his mistress'</li><br><li>'A homicide detective by day, a sleepwalking murderer by night'</li><br><li>'She had to get to the bottom of this deepest secret of her boyfriend's family'</li><br><li>'Technology has now become illegal. He must find a way to bring it back'</li><br><li>'She ate a croissant for breakfast every day'</li><br><li>'He develops a new device that he can implant into his ear that reads the minds of those they focus on'</li><br><li>'Selena got a email from an old school teacher'</li><br><li>'Two friends have a disagreement, and the arguments gets rather heated'</li><br><li>'Diary of a teenager going into adulthood'</li><br><li>'He got a call from a unknown phone number'</li><br><li>'She continuously called him. Continuously asking'</li><br><li>'A young man enters his local library, and thinks to himself, 'Do we still need libraries?''</li><br><li>'Her prom date went ...not so well'</li><br><li>'The exact same person appeared in every single one of her dreams'</li><br><li>'She grew from being clingy... to being independent'</li><br><li>'Their grandparents turned 100 years old today'</li><br><li>'It is Andrew's wedding day. While the vows are being said, someone from the crowd yells, 'I object!''</li><br><li>'I remember the time when...'</li><br><li>'Shame - something he wouldn't be happy to say out loud.'</li><br><li>'Two characters meet for the first time, and one of them has a secret'</li><br></ol><br>As well as the above list, I've also got 2 pieces of advice for writers!<br><br><h3>Advice #1</h3><br>It can also be rather difficult to find spare time to be able to sit and begin writing, even if you have a lot of prompts to write about. I struggle to get time to pursue my hobby of creative writing, as I've been focusing more on my career that hobbies.<br><br>A good way to practise your writing throughout your day is by journaling what you've been up to. Like you're the main character of the story, and you're simply writing about life as it happens, while also noting down how you feel in the moment. Personally, I tend to do some journaling when anything happens, like meeting up with friends or attending a funeral. However, if you like fictional creative writing, you could still journal, but add some creative twists to the diary, from the POV of one of your characters.<br><h3>Advice #2</h3><br>But, what if <b>none</b> of the prompts in the above list are that intriguing to you? That's not a problem, dear writer! A fun little activity is what I like to call 'freestyle writing'.<br><br>This is how it works: You write for 3 to 5 minutes whatever spills out of your head, don’t think too much. Then, you pick the most interesting phrase from that freestyle writing session and write a 10 line monologue inspired by the phrase.<br><br>If you found this article helpful, be sure to come back again for more creative writing articles here at JJDBlogs.",
        "Creative Writing",
        "08/09/2024 14:59"
    ],

    "2": [
        "https://jjdblogs.org.uk/images/web_dev_projects.png",
        "1119",
        "460",
        "10+ Unique Project Ideas to Develop Your Web Development Skills (2024)",
        "If you're like me, you want to develop your web dev skills, but are unsure about what sort of projects to work on. Maybe you want to start creating websites to stand out from the crowd.<br><br>In this article, I've created a list of 9 unique and interesting web dev project ideas, for all levels in wev development, so you can begin coding right away. Each idea has a small description, as well as what level of difficulty it is to create.<br><br><ol><br>    <li><br>To-Do List<br>A to-do list application where users can add, edit, and delete tasks. You can also add features like task prioritization and due dates.<br>Difficulty: Easy<br>    </li><br>    <li><br>Photography Gallery<br>A website to display your photography or artwork. You can create a gallery with categories, lightbox effects, and responsive design to ensure it looks great on all devices.<br>Difficulty: Easy<br>    </li><br>    <li><br>Interactive Resume<br>An interactive and visually appealing resume that highlights your education, work experience, skills, and achievements. You can use animations and transitions to make it engaging.<br>Difficulty: Medium<br>    </li><br>    <li><br>Quiz Game<br>A quiz game website where users can answer questions and get instant feedback. You can create different categories and keep track of scores.<br>Difficulty: Medium<br>    </li><br>    <li><br>Tech Blog<br>A blog focused on technology topics that interest you. Include categories, tags, and a commenting system. You can also add social media sharing buttons.<br>Difficulty: Medium<br>    </li><br>    <li><br>Digital Clock<br>Create a digital clock with HTML and CSS, and add JavaScript to make it functional. You can experiment with different styles and animations.<br>Difficulty: Medium<br>    </li><br>    <li><br>Landing Page for a Product or Service<br>A promotional landing page for a product or service. Include sections for features, pricing, testimonials, and a call-to-action button.<br>Difficulty: Hard<br>    </li><br>    <li><br>E-commerce Store<br>A basic e-commerce website where you can showcase products for sale. Include product pages, a shopping cart, and a checkout process. This can be a great way to practice more advanced HTML and CSS techniques.<br>Difficulty: Hard<br>    </li><br></ol><br><br><h3>Projects with Varying Difficulty</h3><br>The following projects vary with its difficulty, depending on various factors.<br><br><ol><br>    <li><br>Integrated Development Environment (IDE)<br>Software used to run and execute code. You can create it for only one language, or try and experiment with running multiple programming languages.<br>Difficulty for IDE that runs one language - Medium<br>Difficulty for IDE that runs multiple languages - Hard<br>    </li><br>    <li><br>Speed Coding Game<br>A game where you must complete the coding challenge within a certain period of time. When the timer ends, the code is then executed and checked to see if it passes all test cases.<br>Difficulty for IDE that runs one language - Medium<br>Difficulty for IDE that runs multiple languages - Hard<br>    </li><br>    <li><br>Webpage Clone of Popular Websites<br>Choose a website, such as Google, YouTube or Netflix, and try and build the interface from scratch. Try and replicate the interface as detailed as possible.<br>Difficulty: Depends on the website you're copying (some websites have less content)<br>    </li><br></ol><br><br>Of course, there's unlimited possibilities for what websites you can create, but these are just some key ideas that can help you get coding. It's important to remember that it doesn't matter how amazing and 'wow' an idea is if you're simply practising your skills. These project are for you personally. And hey, if you manage to make these websites stand out from the crowd, you could always publish them to the web. You can use GitHub Pages to get your website online for free. I used it for my portfolio website.<br><br>Thank you for checking out this blog post! I hope it provided some insightful info for you. Stay tuned for more, at JJDBlogs.",
        "Web Development",
        "08/09/2024 21:00"
    ]
}