{
    "1": [
        "https://jjdblogs.org.uk/images/writing_prompts.png",
        "Image Created by Jessica Davies",
        "629",
        "350",
        "20+ Intriguing Writing Prompts to Inspire You to Start Writing Today",
        "It's difficult to find inspiration as a creative writer, especially if you wish to get into creative writing, or the creative industry in general. If you're feeling a little low on inspiration, you've come to the right article! I've compiled a list of completely random writing prompts, of all genres, for you to be inspired and to start writing short & fictitious stories today.<br>One piece of advice I like to give to writers is to always remember to <b>write what you would like to read!</b> Whether that's murder mysteries, or science-fiction, it's your canvas, you write whatever you want.<br>Without further ado, let's look at the list!<br><ol><br><li>'He was invited to have an exclusive interview with the CEO'</li><br><li>'Stop calling me, Matthew. I've had enough'</li><br><li>'Her husband accidentally sent her a text that was meant for his mistress'</li><br><li>'A homicide detective by day, a sleepwalking murderer by night'</li><br><li>'She had to get to the bottom of this deepest secret of her boyfriend's family'</li><br><li>'Technology has now become illegal. He must find a way to bring it back'</li><br><li>'She ate a croissant for breakfast every day'</li><br><li>'He develops a new device that he can implant into his ear that reads the minds of those they focus on'</li><br><li>'Selena got a email from an old school teacher'</li><br><li>'Two friends have a disagreement, and the arguments gets rather heated'</li><br><li>'Diary of a teenager going into adulthood'</li><br><li>'He got a call from a unknown phone number'</li><br><li>'She continuously called him. Continuously asking'</li><br><li>'A young man enters his local library, and thinks to himself, 'Do we still need libraries?''</li><br><li>'Her prom date went ...not so well'</li><br><li>'The exact same person appeared in every single one of her dreams'</li><br><li>'She grew from being clingy... to being independent'</li><br><li>'Their grandparents turned 100 years old today'</li><br><li>'It is Andrew's wedding day. While the vows are being said, someone from the crowd yells, 'I object!''</li><br><li>'I remember the time when...'</li><br><li>'Shame - something he wouldn't be happy to say out loud.'</li><br><li>'Two characters meet for the first time, and one of them has a secret'</li><br></ol><br>As well as the above list, I've also got 2 pieces of advice for writers!<br><br><h3>Advice #1</h3><br>It can also be rather difficult to find spare time to be able to sit and begin writing, even if you have a lot of prompts to write about. I struggle to get time to pursue my hobby of creative writing, as I've been focusing more on my career that hobbies.<br>A good way to practise your writing throughout your day is by journaling what you've been up to. Like you're the main character of the story, and you're simply writing about life as it happens, while also noting down how you feel in the moment. Personally, I tend to do some journaling when anything happens, like meeting up with friends or attending a funeral. However, if you like fictional creative writing, you could still journal, but add some creative twists to the diary, from the POV of one of your characters.<br><h3>Advice #2</h3><br>But, what if <b>none</b> of the prompts in the above list are that intriguing to you? That's not a problem, dear writer! A fun little activity is what I like to call 'freestyle writing'.<br>This is how it works: You write for 3 to 5 minutes whatever spills out of your head, don’t think too much. Then, you pick the most interesting phrase from that freestyle writing session and write a 10 line monologue inspired by the phrase.<br><br>If you found this article helpful, be sure to come back again for more creative writing articles here at JJDBlogs.",
        "Creative Writing",
        "06/09/2024 20:40"
    ]
}