{
    "1": [
        "https://jjdblogs.org.uk/images/guide_html_css.png",
        "632",
        "352",
        "The Ultimate Beginner's Guide to HTML and CSS",
        "Web development is highly used in literally every single business you have come across, and it's used to provide people with a way to design, develop, and publish a website that does... well, anything you want it to. If you're a beginner wanting to get into web development, you've come to the right article!<br><br>In this guide, I will walk you through the basics of HTML and CSS, starting with HTML for structure and layout, then CSS for style and design.<br><br><h3>Why Learn HTML and CSS?</h3><br>Now, as a beginner programmer, you may be thinking to yourself: '<em>There's plenty of website builders across the web, why would I spend time learning these languages, when I can just drag and drop elements onto my webpage and call it a day?</em>', and to that I say that most of these website building apps are pricey, but I agree that it can be much simpler since all you're doing is drag and drop. However, in my own experience, when I write my own website code from scratch, it feels more personal. Using basic HTML tags with some CSS styling, you can create some amazing designs, and don't need to spend any money.<br><br><h3>Requirement Recommendations</h3><br>For this tutorial, I'd highly recommend two things:<br><ol><br>    <li>Download Visual Studio Code (VS Code), which is completely free, and is a very popular IDE for literally writing code in <b>any programming language</b>. However, you can still use just a regular notepad, as long as you save your code as <code style='background-color: black; color: green;'>.html</code> and <code style='background-color: black; color: green;'>.css</code> respectively.</li><br>    <li>Type out each piece of code from each image. When copying and pasting code, or just downloading the source code for this tutorial, then chances are, the next day, you'll completely forget about what you learnt. However, typing out the code will help you in the long-term with learning to code.</li><br></ol><br>Be sure to check <a href='https://github.com/jjdaviesblogs/html_css_source'>here</a> if you want to view or download the source code for this tutorial on GitHub!<br><br>Now that that's out the way, let's begin!<br><br><h3>Skeleton Code for HTML</h3><br>On VS Code, after creating a new <code style='background-color: black; color: green;'>.HTML</code> file, if you type <code style='background-color: black; color: green;'>Shift+!+Enter</code>, it will generate some skeleton that looks like this:<br><br><img src='https://jjdblogs.org.uk/imgs_in_article/html_guide_1.png'><br><br>Let's go through each line in the above image.<br><br><code style='background-color: black; color: green;'><br>    &lt;!DOCTYPE html&gt;<br>    &lt;html lang='en'&gt;<br></code><br><br>These two lines declare the type of document it is, as well as sets the language to English.<br><br><code style='background-color: black; color: green;'><br>    &lt;head&gt;<br></code><br><br>This is used for defining the title in the browser's title bar or tab, as well as any metadata. You can think of metadata as 'data that describes other data'. In this case, the metadata is describing our webpage.<br><br><code style='background-color: black; color: green;'><br>    &lt;meta name='viewport' content='width=device-width, initial-scale=1.0'&gt;<br></code><br><br>This metadata declares that the webpage will be responsive, depending on the device used to view it.<br><br><code style='background-color: black; color: green;'><br>    &lt;body&gt;<br></code><br><br>This HTML tag is used to define the content in the main window of your webpage. Currently, it's empty, but we can give it some content to display.<br><br><h3>Basic HTML Tags</h3><br>Let's start with headers. There's 6 types of headers, as shown on the webpage below, as well as their respected HTML tags:<br><br><img src='https://jjdblogs.org.uk/imgs_in_article/html_guide_2.png'><br><br>Not many developers use &lt;h3&gt; downwards, but they're there if you want to play around with them.<br><br>To display text or a paragraph onto the webpage, you can use the &lt;p&gt; tag.<br><br>Let's add a h1 tag with the text 'Why Learn HTML?', and a p element with the following text:<br><br><img src='https://jjdblogs.org.uk/imgs_in_article/html_guide_3.png'><br><br>Now save the code as <code style='background-color: black; color: green;'>index.html</code> and execute the code:<br><br><img src='https://jjdblogs.org.uk/imgs_in_article/html_guide_4.png'><br><br>The next tag to look at is the list element. There's two types of lists you can make in HTML, <b>unordered and ordered</b>, each with its own HTML tags. Take a look at the following code:<br><br><img src='https://jjdblogs.org.uk/imgs_in_article/html_guide_5.png'><br><br>Saving this code and running it, you get the following output:<br><br><img src='https://jjdblogs.org.uk/imgs_in_article/html_guide_6.png'><br><br>So, &lt;ol&gt; is used to define an ordered list (OL - Ordered List), and &lt;ul&gt; is used to define an unordered list (UL - Unordered List). Then, inside each, you have &lt;li&gt; which is called a list element, self-explanatory.<br><br>The tag &lt;img&gt; is used to upload images to your website. It's used as shown below:<br><br><code style='background-color: black; color: green;'><br>    &lt;img src='path/to/your/file.png' width='200' height='400'&gt;<br></code><br><br>This is what's called a self-closing tag, which means that you don't need to type &lt;/img&gt; after it.<br><br><code style='background-color: black; color: green;'>src, width and height</code> are known as <b>attributes</b>. In this case, src is where the file is stored, width and height are the dimensions of the image, in <b>pixels</b>. So the image has a width of 200 pixels and a height of 400 pixels (or px for short).<br><br>Let's now add a picture of a daffodil onto our current webpage. The image will have a width of 300px and a height of 400px. Here's the code:<br><br><img src='https://jjdblogs.org.uk/imgs_in_article/html_guide_7.png'><br><br>And here's the output:<br><br><img src='https://jjdblogs.org.uk/imgs_in_article/html_guide_8.png'><br><br>Now, let's look at the bold and italics tags. To turn your text bold, simply type <code style='background-color: black; color: green;'>&lt;b&gt;</code>, and to turn your text to italics, type simply type <code style='background-color: black; color: green;'>&lt;em&gt;</code><br><br>Let's turn some of our text bold on our webpage so far.<br><br><img src='https://jjdblogs.org.uk/imgs_in_article/html_guide_9.png'><br><br>Running the code, we get the following:<br><br><img src='https://jjdblogs.org.uk/imgs_in_article/html_guide_10.png'><br><br>(TO BE CONTINUED)",
        "Web Development",
        "13/09/2024 21:30"
    ]
}
